---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditElements
source: html/98a28123-c0ca-9718-f32a-3d2697ad7fd0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditElements Property

Workset is editable, but you can't edit the element until '[Borrowers]' resaves the element to central and relinquishes it and you Reload Latest.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotEditElements { get; }
```